<?php
//desc 原神祈愿模拟
//usage 输入 ::原神祈愿 帮助 以查看

define("GACHA_ID",array(
	"11"=>"杯装之诗/0928-1018 (温迪, 芭芭拉, 菲谢尔, 香菱)",
	"12"=>"闪焰的驻足/1020-1110 (可莉, 行秋, 诺艾尔, 砂糖)",
	"13"=>"暂别冬都/1111-1201 (达达利亚, 迪奥娜, 北斗, 凝光)",
	"14"=>"陵薮市朝/1201-1222 (钟离, 辛焱, 雷泽, 重云)",
	"15"=>"深秘之息/1223-0112 (阿贝多, 菲谢尔, 砂糖, 班尼特)",
	"16"=>"浮生孰来/0112-0202 (甘雨, 香菱, 行秋, 诺艾尔)",
	"17"=>"烟火之邀/0203-0217 (魈, 迪奥娜, 北斗, 辛焱)",
	"18"=>"鱼龙灯昼/0217-0302 (刻晴, 凝光, 班尼特, 芭芭拉)",
	"19"=>"赤团开时/0302-0316 (胡桃, 行秋, 香菱, 重云)",
	"110"=>"杯装之诗 复刻/0317-0406 (温迪, 砂糖, 雷泽, 诺艾尔)",
	"111"=>"暂别冬都 复刻/0406-0427 (达达利亚, 罗莎莉亚, 芭芭拉, 菲谢尔)",
	"112"=>"陵薮市朝 复刻/0428-0518 (钟离, 烟绯, 诺艾尔, 迪奥娜)",
	"113"=>"浪涌之瞬 复刻/0518-0608 (优菈, 辛焱, 行秋, 北斗)",
	"114"=>"闪焰的驻足 复刻/0608-0629 (可莉, 砂糖, 菲谢尔, 芭芭拉)",
	"115"=>"叶落风随/0629-0720 (枫原万叶, 罗莎莉亚, 班尼特, 雷泽)",
	"116"=>"白鹭之庭/0721-0810 (神里绫华, 烟绯, 凝光, 重云)",
	"117"=>"焰色天河/0810-0831 (宵宫, 早柚, 迪奥娜, 辛焱)",
	"118"=>"影寂天下人/0901-0921 (雷电将军, 九条裟罗, 香菱, 砂糖)",
	"119"=>"浮岳虹珠/0921-1012 (珊瑚宫心海, 罗莎莉亚, 北斗, 行秋)",
	"120"=>"暂别冬都 复刻/1013-1102 (达达利亚, 凝光, 重云, 烟绯)",
	"121"=>"赤团开时 复刻/1102-1123 (胡桃, 托马, 迪奥娜, 早柚)",
	"122"=>"深秘之息 复刻/1124-1214 (阿贝多, 罗莎莉亚, 诺艾尔, 班尼特)",
	"123"=>"鬼门斗宴/1214-0104 (荒泷一斗, 五郎, 香菱, 芭芭拉)",
	"124"=>"出尘入世/0105-0125 (申鹤, 云堇, 凝光, 重云)",
	"125"=>"陵薮市朝 复刻/0125- (钟离, 烟绯, 行秋, 北斗)",
	"21"=>"浪涌之瞬 复刻/1124-1214 (优菈, 罗莎莉亚, 诺艾尔, 班尼特)",
	"22"=>"烟火之邀 复刻/0105-0125 (魈, 云堇, 凝光, 重云)",
	"23"=>"浮生孰来 复刻/0125- (甘雨, 烟绯, 行秋, 北斗)",
	"31"=>"0928-1018 (风鹰剑, 阿莫斯之弓, 笛剑, 钟剑, 流浪乐章, 绝弦, 西风长枪)",
	"32"=>"1020-1109 (四风原典, 狼的末路, 祭礼剑, 祭礼弓, 祭礼大剑, 祭礼残章, 匣里灭辰)",
	"33"=>"1111-1201 (尘世之锁, 天空之翼, 雨裁, 昭心, 弓藏, 西风长枪, 笛剑)",
	"34"=>"1201-1222 (贯虹之槊, 无工之剑, 匣里龙吟, 钟剑, 西风秘典, 西风猎弓, 匣里灭辰)",
	"35"=>"1223-0112 (斫峰之刃, 天空之卷, 西风剑, 西风大剑, 西风长枪, 祭礼残章, 绝弦)",
	"36"=>"0112-0202 (天空之傲, 阿莫斯之弓, 祭礼剑, 钟剑, 匣里灭辰, 昭心, 西风猎弓)",
	"37"=>"0203-0223 (磐岩结绿, 和璞鸢, 弓藏, 昭心, 西风长枪, 祭礼大剑, 笛剑)",
	"38"=>"0223-0316 (护摩之杖, 狼的末路, 千岩古剑, 千岩长枪, 祭礼弓, 流浪乐章, 匣里龙吟)",
	"39"=>"0317-0406 (终末嗟叹之诗, 天空之刃, 暗巷闪光, 暗巷的酒与诗, 西风大剑, 西风猎弓, 匣里灭辰)",
	"310"=>"0406-0427 (天空之翼, 四风原典, 暗巷猎手, 西风剑, 祭礼大剑, 西风秘典, 西风长枪)",
	"311"=>"0428-0518 (斫峰之刃, 尘世之锁, 笛剑, 千岩古剑, 千岩长枪, 昭心, 祭礼弓)",
	"312"=>"0518-0608 (松籁响起之时, 风鹰剑, 祭礼剑, 雨裁, 匣里灭辰, 祭礼残章, 弓藏)",
	"313"=>"0609-0629 (天空之傲, 四风原典, 幽夜华尔兹, 匣里龙吟, 钟剑, 西风长枪, 流浪乐章)",
	"314"=>"0629-0720 (苍古自由之誓, 天空之卷, 暗巷闪光, 暗巷的酒与诗, 暗巷猎手, 西风大剑, 匣里灭辰)",
	"315"=>"0721-0810 (雾切之回光, 天空之脊, 绝弦, 西风剑, 西风长枪, 西风秘典, 祭礼大剑)",
	"316"=>"0810-0831 (飞雷之弦振, 天空之刃, 西风猎弓, 祭礼剑, 匣里灭辰, 雨裁, 祭礼残章)",
	"317"=>"0901-0921 (薙草之稻光, 无工之剑, 祭礼弓, 匣里龙吟, 流浪乐章, 西风长枪, 钟剑)",
	"318"=>"0921-1012 (不灭月华, 磐岩结绿, 笛剑, 西风大剑, 匣里灭辰, 西风秘典, 绝弦)",
	"319"=>"1013-1102 (冬极白星, 尘世之锁, 恶玉丸, 西风剑, 西风长枪, 昭心, 弓藏)",
	"320"=>"1102-1123 (护摩之杖, 终末嗟叹之诗, 断浪长鳍, 曚云之月, 祭礼剑, 雨裁, 流浪乐章)",
	"321"=>"1124-1214 (苍古自由之誓, 松籁响起之时, 暗巷猎手, 匣里龙吟, 匣里灭辰, 暗巷的酒与诗, 祭礼大剑)",
	"322"=>"1214-0104 (赤角石溃杵, 天空之翼, 暗巷闪光, 幽夜华尔兹, 西风长枪, 祭礼残章, 钟剑)",
	"323"=>"0105-0125 (息灾, 和璞鸢, 千岩长枪, 笛剑, 西风猎弓, 流浪乐章, 西风大剑)",
	"324"=>"0125- (贯虹之槊, 阿莫斯之弓, 千岩古剑, 西风剑, 匣里灭辰, 西风秘典, 祭礼弓)",
	"41"=>"奔行世间/0928-1222 (公测)",
	"42"=>"奔行世间/1223-0427 (新增迪奥娜和辛焱)",
	"43"=>"奔行世间/0428-0608 (新增罗莎莉亚)",
	"44"=>"奔行世间/0609-0901 (新增烟绯)",
	"45"=>"奔行世间/0901-1012 (新增早柚)",
	"46"=>"奔行世间/1013-1123 (新增九条裟罗)",
	"47"=>"奔行世间/1124-0104 (新增托马)",
	"48"=>"奔行世间/0105-0125(新增五郎)",
	"49"=>"奔行世间/0126- (新增云堇)",
	"51"=>"新手祈愿"
));
define("HELP", array(
	<<<STR
::原神祈愿 <祈愿ID> <次数,≤50>
Powered By github.com/Jirehlov/Genshin-Impact-Wish-Simulator-Fileout

一、角色活动祈愿
11: 杯装之诗/0928-1018 (温迪, 芭芭拉, 菲谢尔, 香菱)
12: 闪焰的驻足/1020-1110 (可莉, 行秋, 诺艾尔, 砂糖)
13: 暂别冬都/1111-1201 (达达利亚, 迪奥娜, 北斗, 凝光)
14: 陵薮市朝/1201-1222 (钟离, 辛焱, 雷泽, 重云)
15: 深秘之息/1223-0112 (阿贝多, 菲谢尔, 砂糖, 班尼特)
16: 浮生孰来/0112-0202 (甘雨, 香菱, 行秋, 诺艾尔)
17: 烟火之邀/0203-0217 (魈, 迪奥娜, 北斗, 辛焱)
18: 鱼龙灯昼/0217-0302 (刻晴, 凝光, 班尼特, 芭芭拉)
19: 赤团开时/0302-0316 (胡桃, 行秋, 香菱, 重云)
110: 杯装之诗 复刻/0317-0406 (温迪, 砂糖, 雷泽, 诺艾尔)
111: 暂别冬都 复刻/0406-0427 (达达利亚, 罗莎莉亚, 芭芭拉, 菲谢尔)
112: 陵薮市朝 复刻/0428-0518 (钟离, 烟绯, 诺艾尔, 迪奥娜)
113: 浪涌之瞬 复刻/0518-0608 (优菈, 辛焱, 行秋, 北斗)
114: 闪焰的驻足 复刻/0608-0629 (可莉, 砂糖, 菲谢尔, 芭芭拉)
115: 叶落风随/0629-0720 (枫原万叶, 罗莎莉亚, 班尼特, 雷泽)
116: 白鹭之庭/0721-0810 (神里绫华, 烟绯, 凝光, 重云)
117: 焰色天河/0810-0831 (宵宫, 早柚, 迪奥娜, 辛焱)
118: 影寂天下人/0901-0921 (雷电将军, 九条裟罗, 香菱, 砂糖)
119: 浮岳虹珠/0921-1012 (珊瑚宫心海, 罗莎莉亚, 北斗, 行秋)
120: 暂别冬都 复刻/1013-1102 (达达利亚, 凝光, 重云, 烟绯)
121: 赤团开时 复刻/1102-1123 (胡桃, 托马, 迪奥娜, 早柚)
122: 深秘之息 复刻/1124-1214 (阿贝多, 罗莎莉亚, 诺艾尔, 班尼特)
123: 鬼门斗宴/1214-0104 (荒泷一斗, 五郎, 香菱, 芭芭拉)
124: 出尘入世/0105-0125 (申鹤, 云堇, 凝光, 重云)
125: 陵薮市朝 复刻/0125- (钟离, 烟绯, 行秋, 北斗)
二、角色活动祈愿-2
21: 浪涌之瞬 复刻/1124-1214 (优菈, 罗莎莉亚, 诺艾尔, 班尼特)
22: 烟火之邀 复刻/0105-0125 (魈, 云堇, 凝光, 重云)
23: 浮生孰来 复刻/0125- (甘雨, 烟绯, 行秋, 北斗)
STR,
	<<<STR
三、武器活动祈愿
31: 0928-1018 (风鹰剑, 阿莫斯之弓, 笛剑, 钟剑, 流浪乐章, 绝弦, 西风长枪)
32: 1020-1109 (四风原典, 狼的末路, 祭礼剑, 祭礼弓, 祭礼大剑, 祭礼残章, 匣里灭辰)
33: 1111-1201 (尘世之锁, 天空之翼, 雨裁, 昭心, 弓藏, 西风长枪, 笛剑)
34: 1201-1222 (贯虹之槊, 无工之剑, 匣里龙吟, 钟剑, 西风秘典, 西风猎弓, 匣里灭辰)
35: 1223-0112 (斫峰之刃, 天空之卷, 西风剑, 西风大剑, 西风长枪, 祭礼残章, 绝弦)
36: 0112-0202 (天空之傲, 阿莫斯之弓, 祭礼剑, 钟剑, 匣里灭辰, 昭心, 西风猎弓)
37: 0203-0223 (磐岩结绿, 和璞鸢, 弓藏, 昭心, 西风长枪, 祭礼大剑, 笛剑)
38: 0223-0316 (护摩之杖, 狼的末路, 千岩古剑, 千岩长枪, 祭礼弓, 流浪乐章, 匣里龙吟)
39: 0317-0406 (终末嗟叹之诗, 天空之刃, 暗巷闪光, 暗巷的酒与诗, 西风大剑, 西风猎弓, 匣里灭辰)
310: 0406-0427 (天空之翼, 四风原典, 暗巷猎手, 西风剑, 祭礼大剑, 西风秘典, 西风长枪)
311: 0428-0518 (斫峰之刃, 尘世之锁, 笛剑, 千岩古剑, 千岩长枪, 昭心, 祭礼弓)
312: 0518-0608 (松籁响起之时, 风鹰剑, 祭礼剑, 雨裁, 匣里灭辰, 祭礼残章, 弓藏)
313: 0609-0629 (天空之傲, 四风原典, 幽夜华尔兹, 匣里龙吟, 钟剑, 西风长枪, 流浪乐章)
314: 0629-0720 (苍古自由之誓, 天空之卷, 暗巷闪光, 暗巷的酒与诗, 暗巷猎手, 西风大剑, 匣里灭辰)
315: 0721-0810 (雾切之回光, 天空之脊, 绝弦, 西风剑, 西风长枪, 西风秘典, 祭礼大剑)
316: 0810-0831 (飞雷之弦振, 天空之刃, 西风猎弓, 祭礼剑, 匣里灭辰, 雨裁, 祭礼残章)
317: 0901-0921 (薙草之稻光, 无工之剑, 祭礼弓, 匣里龙吟, 流浪乐章, 西风长枪, 钟剑)
318: 0921-1012 (不灭月华, 磐岩结绿, 笛剑, 西风大剑, 匣里灭辰, 西风秘典, 绝弦)
319: 1013-1102 (冬极白星, 尘世之锁, 恶玉丸, 西风剑, 西风长枪, 昭心, 弓藏)
320: 1102-1123 (护摩之杖, 终末嗟叹之诗, 断浪长鳍, 曚云之月, 祭礼剑, 雨裁, 流浪乐章)
321: 1124-1214 (苍古自由之誓, 松籁响起之时, 暗巷猎手, 匣里龙吟, 匣里灭辰, 暗巷的酒与诗, 祭礼大剑)
322: 1214-0104 (赤角石溃杵, 天空之翼, 暗巷闪光, 幽夜华尔兹, 西风长枪, 祭礼残章, 钟剑)
323: 0105-0125 (息灾, 和璞鸢, 千岩长枪, 笛剑, 西风猎弓, 流浪乐章, 西风大剑)
324: 0125- (贯虹之槊, 阿莫斯之弓, 千岩古剑, 西风剑, 匣里灭辰, 西风秘典, 祭礼弓)
STR,
	<<<STR
四、常驻祈愿
41: 奔行世间/0928-1222 (公测)
42: 奔行世间/1223-0427 (新增迪奥娜和辛焱)
43: 奔行世间/0428-0608 (新增罗莎莉亚)
44: 奔行世间/0609-0901 (新增烟绯)
45: 奔行世间/0901-1012 (新增早柚)
46: 奔行世间/1013-1123 (新增九条裟罗)
47: 奔行世间/1124-0104 (新增托马)
48: 奔行世间/0105-0125(新增五郎)
49: 奔行世间/0126- (新增云堇)
51: 新手祈愿
STR
));

function permission()
{
	global $allow_user;
	global $allow_group;
	global $deny_user;
	global $deny_group;
};

function msg_handler($args)
{
	if ($args['message_type'] == "group") {
		if (do_cooldown('gi',300,$args)) {return;};
	};
	if ($args['command'] == "帮助") {
		if ($args['message_type'] == "group") {
			$messages = array(
				array(
					"type" => "node",
					"data" => array(
						"name" => "Bot",
						"uin" => strval(BOT_UIN),
						"content" => HELP[0]
					),
				)
			);
			cqhttp_api("send_group_forward_msg", array("message_type" => "group", "group_id" => $args['group_id'], "messages" => json_encode($messages)));
			$messages = array(
				array(
					"type" => "node",
					"data" => array(
						"name" => "Bot",
						"uin" => strval(BOT_UIN),
						"content" => HELP[1]
					),
				),
				array(
					"type" => "node",
					"data" => array(
						"name" => "Bot",
						"uin" => strval(BOT_UIN),
						"content" => HELP[2].PHP_EOL.PHP_EOL."注：为防滥用刷屏，请尽量在私聊使用本功能，在群里会有五分钟冷却。"
					),
				)
			);
			cqhttp_api("send_group_forward_msg", array("message_type" => "group", "group_id" => $args['group_id'], "messages" => json_encode($messages)));
		} else {
			send_msg($args,HELP[0]);
			send_msg($args,HELP[1]);
			send_msg($args,HELP[2]);
		};
		return;
	} else {
		// 正式
		$gacha_args = explode(" ", $args['command'], 2);
		$gacha_args[1] = intval($gacha_args[1]);
		if (!($gacha_args[1]<51)) {
			send_msg($args, "参数错误，详情请查看帮助，“::原神祈愿 帮助”");
			return;
		};
		exec(getcwd() . "/giwsfo " . substr($gacha_args[0], 0, 1) . " " . substr($gacha_args[0], 1) . " " . $gacha_args[1], $retval);
		$gacha = file_get_contents(getcwd() . "/output.txt");
			$gacha = GACHA_ID[$gacha_args[0]]." (x".$gacha_args[1].") 结果如下：".PHP_EOL.trim(explode(PHP_EOL . "本次祈愿开始于: ", explode("本次祈愿结果如下:", $gacha)[1])[0]).PHP_EOL.PHP_EOL.trim(explode(PHP_EOL . "好运参考值", explode($gacha_args[1]." 发。", $gacha)[1])[0]);
		if ($args['message_type'] == "group") {
		$messages = array(
			array(
				"type" => "node",
				"data" => array(
					"name" => "原神祈愿模拟器",
					"uin" => strval(BOT_UIN),
					"content" => $gacha.PHP_EOL.PHP_EOL."注：为防滥用刷屏，请尽量在私聊使用本功能，在群里会有五分钟冷却。"
				),
			)
		);
		cqhttp_api("send_group_forward_msg", array("message_type" => "group", "group_id" => $args['group_id'], "messages" => json_encode($messages)));
		} else {
			send_msg($args,$gacha);
		};
		return;
	};
};
